## Grouping

In [1]:
import pandas as pd
import numpy as np

from pandas import Series, DataFrame

In [2]:
file_location = r'C:/Users/sharvan.das/Desktop/Python Data Science/DataSets/list_of_real_usa_addresses.csv'

In [5]:
df = pd.read_csv(file_location)

In [6]:
df.head()

               address        city state   zip
0  777 Brockton Avenue    Abington    MA  2351
1    30 Memorial Drive        Avon    MA  2322
2  250 Hartford Avenue  Bellingham    MA  2019
3       700 Oak Street    Brockton    MA  2301
4    66-4 Parkhurst Rd  Chelmsford    MA  1824

In [7]:
df_groupby = df.groupby(df['state'])

In [8]:
print(df_groupby.count())

       address  city  zip
state
AL         101   101  101
CT          33    33   33
MA          42    42   42
NY          58    58   58

In [10]:
df1 = DataFrame({
    'Category': ['A', 'B', 'A', 'B', 'A', 'C'],
    'Value': [10, 20, 15, 25, 10, 30],
    'Quantity': [1, 2, 1, 3, 1, 2]
})
print(df)

  Category  Value  Quantity
0        A     10         1
1        B     20         2
2        A     15         1
3        B     25         3
4        A     10         1
5        C     30         2

In [11]:
df1.head()

  Category  Value  Quantity
0        A     10         1
1        B     20         2
2        A     15         1
3        B     25         3
4        A     10         1

In [12]:
grouped1 = df.groupby('Category').sum()

In [13]:
grouped1

          Value  Quantity
Category
A            35         3
B            45         5
C            30         2

In [14]:
grouped2 = df.groupby('Category')['Value'].sum()

In [15]:
grouped2

Category
A    35
B    45
C    30
Name: Value, dtype: int64

In [16]:
multi_grouped = df.groupby(['Category', 'Quantity']).sum()

In [17]:
multi_grouped

                   Value
Category Quantity
A        1            35
B        2            20
         3            25
C        2            30

In [18]:
multi_grouped_with_agg = df.groupby('Category').agg({'Quantity':'sum', 'Value':'mean'})
print(multi_grouped_with_agg)

          Quantity      Value
Category
A                3  11.666667
B                5  22.500000
C                2  30.000000